// NOTE: This file was generated by the Mojo bindings generator.
#ifndef MOJO_SERVICES_AUTHENTICATION_INTERFACES_AUTHENTICATION_ADMIN_MOJOM_INTERNAL_H_
#define MOJO_SERVICES_AUTHENTICATION_INTERFACES_AUTHENTICATION_ADMIN_MOJOM_INTERNAL_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"
#include "mojo/public/cpp/bindings/lib/union_accessor.h"
#include "mojo/public/cpp/bindings/struct_ptr.h"
#include "mojo/public/cpp/system/buffer.h"
#include "mojo/public/cpp/system/data_pipe.h"
#include "mojo/public/cpp/system/handle.h"
#include "mojo/public/cpp/system/message_pipe.h"

namespace mojo {
namespace internal {
class BoundsChecker;
}
}
namespace authentication {



namespace internal {




#pragma pack(push, 1)



class AuthenticationAdminService_GetOAuth2DeviceCode_Params_Data {
 public:
  static AuthenticationAdminService_GetOAuth2DeviceCode_Params_Data* New(mojo::internal::Buffer* buf);

  static mojo::internal::ValidationError Validate(
      const void* data,
      mojo::internal::BoundsChecker* bounds_checker,
      std::string* err);

  void EncodePointersAndHandles(std::vector<mojo::Handle>* handles);
  void DecodePointersAndHandles(std::vector<mojo::Handle>* handles);

  mojo::internal::StructHeader header_;
  mojo::internal::ArrayPointer<mojo::internal::String_Data*> scopes;

 private:
  AuthenticationAdminService_GetOAuth2DeviceCode_Params_Data();
  ~AuthenticationAdminService_GetOAuth2DeviceCode_Params_Data() = delete;
};
static_assert(sizeof(AuthenticationAdminService_GetOAuth2DeviceCode_Params_Data) == 16,
              "Bad sizeof(AuthenticationAdminService_GetOAuth2DeviceCode_Params_Data)");

class AuthenticationAdminService_GetOAuth2DeviceCode_ResponseParams_Data {
 public:
  static AuthenticationAdminService_GetOAuth2DeviceCode_ResponseParams_Data* New(mojo::internal::Buffer* buf);

  static mojo::internal::ValidationError Validate(
      const void* data,
      mojo::internal::BoundsChecker* bounds_checker,
      std::string* err);

  void EncodePointersAndHandles(std::vector<mojo::Handle>* handles);
  void DecodePointersAndHandles(std::vector<mojo::Handle>* handles);

  mojo::internal::StructHeader header_;
  mojo::internal::StringPointer verification_url;
  mojo::internal::StringPointer device_code;
  mojo::internal::StringPointer user_code;
  mojo::internal::StringPointer error;

 private:
  AuthenticationAdminService_GetOAuth2DeviceCode_ResponseParams_Data();
  ~AuthenticationAdminService_GetOAuth2DeviceCode_ResponseParams_Data() = delete;
};
static_assert(sizeof(AuthenticationAdminService_GetOAuth2DeviceCode_ResponseParams_Data) == 40,
              "Bad sizeof(AuthenticationAdminService_GetOAuth2DeviceCode_ResponseParams_Data)");


class AuthenticationAdminService_AddAccount_Params_Data {
 public:
  static AuthenticationAdminService_AddAccount_Params_Data* New(mojo::internal::Buffer* buf);

  static mojo::internal::ValidationError Validate(
      const void* data,
      mojo::internal::BoundsChecker* bounds_checker,
      std::string* err);

  void EncodePointersAndHandles(std::vector<mojo::Handle>* handles);
  void DecodePointersAndHandles(std::vector<mojo::Handle>* handles);

  mojo::internal::StructHeader header_;
  mojo::internal::StringPointer device_code;

 private:
  AuthenticationAdminService_AddAccount_Params_Data();
  ~AuthenticationAdminService_AddAccount_Params_Data() = delete;
};
static_assert(sizeof(AuthenticationAdminService_AddAccount_Params_Data) == 16,
              "Bad sizeof(AuthenticationAdminService_AddAccount_Params_Data)");

class AuthenticationAdminService_AddAccount_ResponseParams_Data {
 public:
  static AuthenticationAdminService_AddAccount_ResponseParams_Data* New(mojo::internal::Buffer* buf);

  static mojo::internal::ValidationError Validate(
      const void* data,
      mojo::internal::BoundsChecker* bounds_checker,
      std::string* err);

  void EncodePointersAndHandles(std::vector<mojo::Handle>* handles);
  void DecodePointersAndHandles(std::vector<mojo::Handle>* handles);

  mojo::internal::StructHeader header_;
  mojo::internal::StringPointer username;
  mojo::internal::StringPointer error;

 private:
  AuthenticationAdminService_AddAccount_ResponseParams_Data();
  ~AuthenticationAdminService_AddAccount_ResponseParams_Data() = delete;
};
static_assert(sizeof(AuthenticationAdminService_AddAccount_ResponseParams_Data) == 24,
              "Bad sizeof(AuthenticationAdminService_AddAccount_ResponseParams_Data)");


class AuthenticationAdminService_GetAllUsers_Params_Data {
 public:
  static AuthenticationAdminService_GetAllUsers_Params_Data* New(mojo::internal::Buffer* buf);

  static mojo::internal::ValidationError Validate(
      const void* data,
      mojo::internal::BoundsChecker* bounds_checker,
      std::string* err);

  void EncodePointersAndHandles(std::vector<mojo::Handle>* handles);
  void DecodePointersAndHandles(std::vector<mojo::Handle>* handles);

  mojo::internal::StructHeader header_;

 private:
  AuthenticationAdminService_GetAllUsers_Params_Data();
  ~AuthenticationAdminService_GetAllUsers_Params_Data() = delete;
};
static_assert(sizeof(AuthenticationAdminService_GetAllUsers_Params_Data) == 8,
              "Bad sizeof(AuthenticationAdminService_GetAllUsers_Params_Data)");

class AuthenticationAdminService_GetAllUsers_ResponseParams_Data {
 public:
  static AuthenticationAdminService_GetAllUsers_ResponseParams_Data* New(mojo::internal::Buffer* buf);

  static mojo::internal::ValidationError Validate(
      const void* data,
      mojo::internal::BoundsChecker* bounds_checker,
      std::string* err);

  void EncodePointersAndHandles(std::vector<mojo::Handle>* handles);
  void DecodePointersAndHandles(std::vector<mojo::Handle>* handles);

  mojo::internal::StructHeader header_;
  mojo::internal::ArrayPointer<mojo::internal::String_Data*> usernames;
  mojo::internal::StringPointer error;

 private:
  AuthenticationAdminService_GetAllUsers_ResponseParams_Data();
  ~AuthenticationAdminService_GetAllUsers_ResponseParams_Data() = delete;
};
static_assert(sizeof(AuthenticationAdminService_GetAllUsers_ResponseParams_Data) == 24,
              "Bad sizeof(AuthenticationAdminService_GetAllUsers_ResponseParams_Data)");


#pragma pack(pop)

}  // namespace internal
}  // namespace authentication

#endif  // MOJO_SERVICES_AUTHENTICATION_INTERFACES_AUTHENTICATION_ADMIN_MOJOM_INTERNAL_H_
