// NOTE: This file was generated by the Mojo bindings generator.
#ifndef MOJO_SERVICES_AUTHENTICATION_INTERFACES_AUTHENTICATION_MOJOM_INTERNAL_H_
#define MOJO_SERVICES_AUTHENTICATION_INTERFACES_AUTHENTICATION_MOJOM_INTERNAL_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"
#include "mojo/public/cpp/bindings/lib/union_accessor.h"
#include "mojo/public/cpp/bindings/struct_ptr.h"
#include "mojo/public/cpp/system/buffer.h"
#include "mojo/public/cpp/system/data_pipe.h"
#include "mojo/public/cpp/system/handle.h"
#include "mojo/public/cpp/system/message_pipe.h"

namespace mojo {
namespace internal {
class BoundsChecker;
}
}
namespace authentication {



namespace internal {




#pragma pack(push, 1)



class AuthenticationService_SelectAccount_Params_Data {
 public:
  static AuthenticationService_SelectAccount_Params_Data* New(mojo::internal::Buffer* buf);

  static mojo::internal::ValidationError Validate(
      const void* data,
      mojo::internal::BoundsChecker* bounds_checker,
      std::string* err);

  void EncodePointersAndHandles(std::vector<mojo::Handle>* handles);
  void DecodePointersAndHandles(std::vector<mojo::Handle>* handles);

  mojo::internal::StructHeader header_;
  uint8_t return_last_selected : 1;
  uint8_t padfinal_[7];

 private:
  AuthenticationService_SelectAccount_Params_Data();
  ~AuthenticationService_SelectAccount_Params_Data() = delete;
};
static_assert(sizeof(AuthenticationService_SelectAccount_Params_Data) == 16,
              "Bad sizeof(AuthenticationService_SelectAccount_Params_Data)");

class AuthenticationService_SelectAccount_ResponseParams_Data {
 public:
  static AuthenticationService_SelectAccount_ResponseParams_Data* New(mojo::internal::Buffer* buf);

  static mojo::internal::ValidationError Validate(
      const void* data,
      mojo::internal::BoundsChecker* bounds_checker,
      std::string* err);

  void EncodePointersAndHandles(std::vector<mojo::Handle>* handles);
  void DecodePointersAndHandles(std::vector<mojo::Handle>* handles);

  mojo::internal::StructHeader header_;
  mojo::internal::StringPointer username;
  mojo::internal::StringPointer error;

 private:
  AuthenticationService_SelectAccount_ResponseParams_Data();
  ~AuthenticationService_SelectAccount_ResponseParams_Data() = delete;
};
static_assert(sizeof(AuthenticationService_SelectAccount_ResponseParams_Data) == 24,
              "Bad sizeof(AuthenticationService_SelectAccount_ResponseParams_Data)");


class AuthenticationService_GetOAuth2Token_Params_Data {
 public:
  static AuthenticationService_GetOAuth2Token_Params_Data* New(mojo::internal::Buffer* buf);

  static mojo::internal::ValidationError Validate(
      const void* data,
      mojo::internal::BoundsChecker* bounds_checker,
      std::string* err);

  void EncodePointersAndHandles(std::vector<mojo::Handle>* handles);
  void DecodePointersAndHandles(std::vector<mojo::Handle>* handles);

  mojo::internal::StructHeader header_;
  mojo::internal::StringPointer username;
  mojo::internal::ArrayPointer<mojo::internal::String_Data*> scopes;

 private:
  AuthenticationService_GetOAuth2Token_Params_Data();
  ~AuthenticationService_GetOAuth2Token_Params_Data() = delete;
};
static_assert(sizeof(AuthenticationService_GetOAuth2Token_Params_Data) == 24,
              "Bad sizeof(AuthenticationService_GetOAuth2Token_Params_Data)");

class AuthenticationService_GetOAuth2Token_ResponseParams_Data {
 public:
  static AuthenticationService_GetOAuth2Token_ResponseParams_Data* New(mojo::internal::Buffer* buf);

  static mojo::internal::ValidationError Validate(
      const void* data,
      mojo::internal::BoundsChecker* bounds_checker,
      std::string* err);

  void EncodePointersAndHandles(std::vector<mojo::Handle>* handles);
  void DecodePointersAndHandles(std::vector<mojo::Handle>* handles);

  mojo::internal::StructHeader header_;
  mojo::internal::StringPointer token;
  mojo::internal::StringPointer error;

 private:
  AuthenticationService_GetOAuth2Token_ResponseParams_Data();
  ~AuthenticationService_GetOAuth2Token_ResponseParams_Data() = delete;
};
static_assert(sizeof(AuthenticationService_GetOAuth2Token_ResponseParams_Data) == 24,
              "Bad sizeof(AuthenticationService_GetOAuth2Token_ResponseParams_Data)");


class AuthenticationService_ClearOAuth2Token_Params_Data {
 public:
  static AuthenticationService_ClearOAuth2Token_Params_Data* New(mojo::internal::Buffer* buf);

  static mojo::internal::ValidationError Validate(
      const void* data,
      mojo::internal::BoundsChecker* bounds_checker,
      std::string* err);

  void EncodePointersAndHandles(std::vector<mojo::Handle>* handles);
  void DecodePointersAndHandles(std::vector<mojo::Handle>* handles);

  mojo::internal::StructHeader header_;
  mojo::internal::StringPointer token;

 private:
  AuthenticationService_ClearOAuth2Token_Params_Data();
  ~AuthenticationService_ClearOAuth2Token_Params_Data() = delete;
};
static_assert(sizeof(AuthenticationService_ClearOAuth2Token_Params_Data) == 16,
              "Bad sizeof(AuthenticationService_ClearOAuth2Token_Params_Data)");


#pragma pack(pop)

}  // namespace internal
}  // namespace authentication

#endif  // MOJO_SERVICES_AUTHENTICATION_INTERFACES_AUTHENTICATION_MOJOM_INTERNAL_H_
