// This file was auto-generated by the C bindings generator.

#ifndef MOJO_PUBLIC_INTERFACES_BINDINGS_MOJOM_TYPES_MOJOM_C_H_
#define MOJO_PUBLIC_INTERFACES_BINDINGS_MOJOM_TYPES_MOJOM_C_H_

#include <assert.h>
#include <math.h>
#include <stdbool.h>
#include <stdint.h>

#include "mojo/public/c/bindings/array.h"
#include "mojo/public/c/bindings/buffer.h"
#include "mojo/public/c/bindings/interface.h"
#include "mojo/public/c/bindings/lib/type_table.h"
#include "mojo/public/c/bindings/map.h"
#include "mojo/public/c/bindings/string.h"
#include "mojo/public/c/bindings/validation.h"
#include "mojo/public/c/system/handle.h"

// Imports.


// Forward declarations for structs.
struct mojo_bindings_types_StringType;
union mojo_bindings_types_StringTypePtr {
  struct mojo_bindings_types_StringType* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_StringTypePtr) == 8,
              "union mojo_bindings_types_StringTypePtr must be 8 bytes");

struct mojo_bindings_types_HandleType;
union mojo_bindings_types_HandleTypePtr {
  struct mojo_bindings_types_HandleType* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_HandleTypePtr) == 8,
              "union mojo_bindings_types_HandleTypePtr must be 8 bytes");

struct mojo_bindings_types_ArrayType;
union mojo_bindings_types_ArrayTypePtr {
  struct mojo_bindings_types_ArrayType* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_ArrayTypePtr) == 8,
              "union mojo_bindings_types_ArrayTypePtr must be 8 bytes");

struct mojo_bindings_types_MapType;
union mojo_bindings_types_MapTypePtr {
  struct mojo_bindings_types_MapType* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_MapTypePtr) == 8,
              "union mojo_bindings_types_MapTypePtr must be 8 bytes");

struct mojo_bindings_types_TypeReference;
union mojo_bindings_types_TypeReferencePtr {
  struct mojo_bindings_types_TypeReference* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_TypeReferencePtr) == 8,
              "union mojo_bindings_types_TypeReferencePtr must be 8 bytes");

struct mojo_bindings_types_StructField;
union mojo_bindings_types_StructFieldPtr {
  struct mojo_bindings_types_StructField* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_StructFieldPtr) == 8,
              "union mojo_bindings_types_StructFieldPtr must be 8 bytes");

struct mojo_bindings_types_DefaultKeyword;
union mojo_bindings_types_DefaultKeywordPtr {
  struct mojo_bindings_types_DefaultKeyword* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_DefaultKeywordPtr) == 8,
              "union mojo_bindings_types_DefaultKeywordPtr must be 8 bytes");

struct mojo_bindings_types_StructVersion;
union mojo_bindings_types_StructVersionPtr {
  struct mojo_bindings_types_StructVersion* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_StructVersionPtr) == 8,
              "union mojo_bindings_types_StructVersionPtr must be 8 bytes");

struct mojo_bindings_types_MojomStruct;
union mojo_bindings_types_MojomStructPtr {
  struct mojo_bindings_types_MojomStruct* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_MojomStructPtr) == 8,
              "union mojo_bindings_types_MojomStructPtr must be 8 bytes");

struct mojo_bindings_types_UnionField;
union mojo_bindings_types_UnionFieldPtr {
  struct mojo_bindings_types_UnionField* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_UnionFieldPtr) == 8,
              "union mojo_bindings_types_UnionFieldPtr must be 8 bytes");

struct mojo_bindings_types_MojomUnion;
union mojo_bindings_types_MojomUnionPtr {
  struct mojo_bindings_types_MojomUnion* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_MojomUnionPtr) == 8,
              "union mojo_bindings_types_MojomUnionPtr must be 8 bytes");

struct mojo_bindings_types_EnumValue;
union mojo_bindings_types_EnumValuePtr {
  struct mojo_bindings_types_EnumValue* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_EnumValuePtr) == 8,
              "union mojo_bindings_types_EnumValuePtr must be 8 bytes");

struct mojo_bindings_types_MojomEnum;
union mojo_bindings_types_MojomEnumPtr {
  struct mojo_bindings_types_MojomEnum* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_MojomEnumPtr) == 8,
              "union mojo_bindings_types_MojomEnumPtr must be 8 bytes");

struct mojo_bindings_types_MojomMethod;
union mojo_bindings_types_MojomMethodPtr {
  struct mojo_bindings_types_MojomMethod* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_MojomMethodPtr) == 8,
              "union mojo_bindings_types_MojomMethodPtr must be 8 bytes");

struct mojo_bindings_types_MojomInterface;
union mojo_bindings_types_MojomInterfacePtr {
  struct mojo_bindings_types_MojomInterface* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_MojomInterfacePtr) == 8,
              "union mojo_bindings_types_MojomInterfacePtr must be 8 bytes");

struct mojo_bindings_types_ConstantReference;
union mojo_bindings_types_ConstantReferencePtr {
  struct mojo_bindings_types_ConstantReference* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_ConstantReferencePtr) == 8,
              "union mojo_bindings_types_ConstantReferencePtr must be 8 bytes");

struct mojo_bindings_types_EnumValueReference;
union mojo_bindings_types_EnumValueReferencePtr {
  struct mojo_bindings_types_EnumValueReference* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_EnumValueReferencePtr) == 8,
              "union mojo_bindings_types_EnumValueReferencePtr must be 8 bytes");

struct mojo_bindings_types_DeclaredConstant;
union mojo_bindings_types_DeclaredConstantPtr {
  struct mojo_bindings_types_DeclaredConstant* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_DeclaredConstantPtr) == 8,
              "union mojo_bindings_types_DeclaredConstantPtr must be 8 bytes");

struct mojo_bindings_types_Attribute;
union mojo_bindings_types_AttributePtr {
  struct mojo_bindings_types_Attribute* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_AttributePtr) == 8,
              "union mojo_bindings_types_AttributePtr must be 8 bytes");

struct mojo_bindings_types_DeclarationData;
union mojo_bindings_types_DeclarationDataPtr {
  struct mojo_bindings_types_DeclarationData* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_DeclarationDataPtr) == 8,
              "union mojo_bindings_types_DeclarationDataPtr must be 8 bytes");

struct mojo_bindings_types_SourceFileInfo;
union mojo_bindings_types_SourceFileInfoPtr {
  struct mojo_bindings_types_SourceFileInfo* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_SourceFileInfoPtr) == 8,
              "union mojo_bindings_types_SourceFileInfoPtr must be 8 bytes");

struct mojo_bindings_types_ContainedDeclarations;
union mojo_bindings_types_ContainedDeclarationsPtr {
  struct mojo_bindings_types_ContainedDeclarations* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_ContainedDeclarationsPtr) == 8,
              "union mojo_bindings_types_ContainedDeclarationsPtr must be 8 bytes");

struct mojo_bindings_types_RuntimeTypeInfo;
union mojo_bindings_types_RuntimeTypeInfoPtr {
  struct mojo_bindings_types_RuntimeTypeInfo* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_RuntimeTypeInfoPtr) == 8,
              "union mojo_bindings_types_RuntimeTypeInfoPtr must be 8 bytes");

// Forward declarations for unions.
struct mojo_bindings_types_Type;
union mojo_bindings_types_TypePtr {
  struct mojo_bindings_types_Type* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_TypePtr) == 8,
             "union mojo_bindings_types_Type must be 8 bytes");

struct mojo_bindings_types_UserDefinedType;
union mojo_bindings_types_UserDefinedTypePtr {
  struct mojo_bindings_types_UserDefinedType* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_UserDefinedTypePtr) == 8,
             "union mojo_bindings_types_UserDefinedType must be 8 bytes");

struct mojo_bindings_types_DefaultFieldValue;
union mojo_bindings_types_DefaultFieldValuePtr {
  struct mojo_bindings_types_DefaultFieldValue* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_DefaultFieldValuePtr) == 8,
             "union mojo_bindings_types_DefaultFieldValue must be 8 bytes");

struct mojo_bindings_types_Value;
union mojo_bindings_types_ValuePtr {
  struct mojo_bindings_types_Value* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_ValuePtr) == 8,
             "union mojo_bindings_types_Value must be 8 bytes");

struct mojo_bindings_types_LiteralValue;
union mojo_bindings_types_LiteralValuePtr {
  struct mojo_bindings_types_LiteralValue* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_bindings_types_LiteralValuePtr) == 8,
             "union mojo_bindings_types_LiteralValue must be 8 bytes");

// Top level constants.


// Top level enums.
typedef uint32_t mojo_bindings_types_SimpleType;
enum mojo_bindings_types_SimpleType_Enum {
  mojo_bindings_types_SimpleType_BOOL = 0,
  mojo_bindings_types_SimpleType_DOUBLE = 1,
  mojo_bindings_types_SimpleType_FLOAT = 2,
  mojo_bindings_types_SimpleType_INT8 = 3,
  mojo_bindings_types_SimpleType_INT16 = 4,
  mojo_bindings_types_SimpleType_INT32 = 5,
  mojo_bindings_types_SimpleType_INT64 = 6,
  mojo_bindings_types_SimpleType_UINT8 = 7,
  mojo_bindings_types_SimpleType_UINT16 = 8,
  mojo_bindings_types_SimpleType_UINT32 = 9,
  mojo_bindings_types_SimpleType_UINT64 = 10,
  
  mojo_bindings_types_SimpleType__UNKNOWN__ = 0xFFFFFFFF,
};

typedef uint32_t mojo_bindings_types_BuiltinConstantValue;
enum mojo_bindings_types_BuiltinConstantValue_Enum {
  mojo_bindings_types_BuiltinConstantValue_DOUBLE_INFINITY = 0,
  mojo_bindings_types_BuiltinConstantValue_DOUBLE_NEGATIVE_INFINITY = 1,
  mojo_bindings_types_BuiltinConstantValue_DOUBLE_NAN = 2,
  mojo_bindings_types_BuiltinConstantValue_FLOAT_INFINITY = 3,
  mojo_bindings_types_BuiltinConstantValue_FLOAT_NEGATIVE_INFINITY = 4,
  mojo_bindings_types_BuiltinConstantValue_FLOAT_NAN = 5,
  
  mojo_bindings_types_BuiltinConstantValue__UNKNOWN__ = 0xFFFFFFFF,
};



// Union definitions.
// -- mojo_bindings_types_Type --
// Enum describing the union tags.
typedef uint32_t mojo_bindings_types_Type_Tag;
enum mojo_bindings_types_Type_Tag_Enum {
  mojo_bindings_types_Type_Tag_simple_type = 0,
  mojo_bindings_types_Type_Tag_string_type = 1,
  mojo_bindings_types_Type_Tag_array_type = 2,
  mojo_bindings_types_Type_Tag_map_type = 3,
  mojo_bindings_types_Type_Tag_handle_type = 4,
  mojo_bindings_types_Type_Tag_type_reference = 5,
  
  mojo_bindings_types_Type_Tag__UNKNOWN__ = 0xFFFFFFFF,
};


struct mojo_bindings_types_Type {
  uint32_t size;
  mojo_bindings_types_Type_Tag tag;
  
  union {
    mojo_bindings_types_SimpleType f_simple_type;
    union mojo_bindings_types_StringTypePtr f_string_type;
    union mojo_bindings_types_ArrayTypePtr f_array_type;
    union mojo_bindings_types_MapTypePtr f_map_type;
    union mojo_bindings_types_HandleTypePtr f_handle_type;
    union mojo_bindings_types_TypeReferencePtr f_type_reference;
    
    uint64_t unknown;
  } data;
};

MOJO_STATIC_ASSERT(sizeof(struct mojo_bindings_types_Type) == 16,
             "struct mojo_bindings_types_Type must be 16 bytes");

// -- mojo_bindings_types_UserDefinedType --
// Enum describing the union tags.
typedef uint32_t mojo_bindings_types_UserDefinedType_Tag;
enum mojo_bindings_types_UserDefinedType_Tag_Enum {
  mojo_bindings_types_UserDefinedType_Tag_enum_type = 0,
  mojo_bindings_types_UserDefinedType_Tag_struct_type = 1,
  mojo_bindings_types_UserDefinedType_Tag_union_type = 2,
  mojo_bindings_types_UserDefinedType_Tag_interface_type = 3,
  
  mojo_bindings_types_UserDefinedType_Tag__UNKNOWN__ = 0xFFFFFFFF,
};


struct mojo_bindings_types_UserDefinedType {
  uint32_t size;
  mojo_bindings_types_UserDefinedType_Tag tag;
  
  union {
    union mojo_bindings_types_MojomEnumPtr f_enum_type;
    union mojo_bindings_types_MojomStructPtr f_struct_type;
    union mojo_bindings_types_MojomUnionPtr f_union_type;
    union mojo_bindings_types_MojomInterfacePtr f_interface_type;
    
    uint64_t unknown;
  } data;
};

MOJO_STATIC_ASSERT(sizeof(struct mojo_bindings_types_UserDefinedType) == 16,
             "struct mojo_bindings_types_UserDefinedType must be 16 bytes");

// -- mojo_bindings_types_DefaultFieldValue --
// Enum describing the union tags.
typedef uint32_t mojo_bindings_types_DefaultFieldValue_Tag;
enum mojo_bindings_types_DefaultFieldValue_Tag_Enum {
  mojo_bindings_types_DefaultFieldValue_Tag_value = 0,
  mojo_bindings_types_DefaultFieldValue_Tag_default_keyword = 1,
  
  mojo_bindings_types_DefaultFieldValue_Tag__UNKNOWN__ = 0xFFFFFFFF,
};


struct mojo_bindings_types_DefaultFieldValue {
  uint32_t size;
  mojo_bindings_types_DefaultFieldValue_Tag tag;
  
  union {
    union mojo_bindings_types_ValuePtr f_value;
    union mojo_bindings_types_DefaultKeywordPtr f_default_keyword;
    
    uint64_t unknown;
  } data;
};

MOJO_STATIC_ASSERT(sizeof(struct mojo_bindings_types_DefaultFieldValue) == 16,
             "struct mojo_bindings_types_DefaultFieldValue must be 16 bytes");

// -- mojo_bindings_types_Value --
// Enum describing the union tags.
typedef uint32_t mojo_bindings_types_Value_Tag;
enum mojo_bindings_types_Value_Tag_Enum {
  mojo_bindings_types_Value_Tag_literal_value = 0,
  mojo_bindings_types_Value_Tag_constant_reference = 1,
  mojo_bindings_types_Value_Tag_enum_value_reference = 2,
  mojo_bindings_types_Value_Tag_builtin_value = 3,
  
  mojo_bindings_types_Value_Tag__UNKNOWN__ = 0xFFFFFFFF,
};


struct mojo_bindings_types_Value {
  uint32_t size;
  mojo_bindings_types_Value_Tag tag;
  
  union {
    union mojo_bindings_types_LiteralValuePtr f_literal_value;
    union mojo_bindings_types_ConstantReferencePtr f_constant_reference;
    union mojo_bindings_types_EnumValueReferencePtr f_enum_value_reference;
    mojo_bindings_types_BuiltinConstantValue f_builtin_value;
    
    uint64_t unknown;
  } data;
};

MOJO_STATIC_ASSERT(sizeof(struct mojo_bindings_types_Value) == 16,
             "struct mojo_bindings_types_Value must be 16 bytes");

// -- mojo_bindings_types_LiteralValue --
// Enum describing the union tags.
typedef uint32_t mojo_bindings_types_LiteralValue_Tag;
enum mojo_bindings_types_LiteralValue_Tag_Enum {
  mojo_bindings_types_LiteralValue_Tag_bool_value = 0,
  mojo_bindings_types_LiteralValue_Tag_double_value = 1,
  mojo_bindings_types_LiteralValue_Tag_float_value = 2,
  mojo_bindings_types_LiteralValue_Tag_int8_value = 3,
  mojo_bindings_types_LiteralValue_Tag_int16_value = 4,
  mojo_bindings_types_LiteralValue_Tag_int32_value = 5,
  mojo_bindings_types_LiteralValue_Tag_int64_value = 6,
  mojo_bindings_types_LiteralValue_Tag_string_value = 7,
  mojo_bindings_types_LiteralValue_Tag_uint8_value = 8,
  mojo_bindings_types_LiteralValue_Tag_uint16_value = 9,
  mojo_bindings_types_LiteralValue_Tag_uint32_value = 10,
  mojo_bindings_types_LiteralValue_Tag_uint64_value = 11,
  
  mojo_bindings_types_LiteralValue_Tag__UNKNOWN__ = 0xFFFFFFFF,
};


struct mojo_bindings_types_LiteralValue {
  uint32_t size;
  mojo_bindings_types_LiteralValue_Tag tag;
  
  union {
    bool bool_value : 1;
    double f_double_value;
    float f_float_value;
    int8_t f_int8_value;
    int16_t f_int16_value;
    int32_t f_int32_value;
    int64_t f_int64_value;
    union MojomStringPtr f_string_value;
    uint8_t f_uint8_value;
    uint16_t f_uint16_value;
    uint32_t f_uint32_value;
    uint64_t f_uint64_value;
    
    uint64_t unknown;
  } data;
};

MOJO_STATIC_ASSERT(sizeof(struct mojo_bindings_types_LiteralValue) == 16,
             "struct mojo_bindings_types_LiteralValue must be 16 bytes");



// Struct definitions.
// -- mojo_bindings_types_StringType --
// Enums
// Constants
// Struct definition
struct mojo_bindings_types_StringType {
  struct MojomStructHeader header_;
  bool nullable : 1;  // offset,bit = 0,0
  
};

struct mojo_bindings_types_StringType* mojo_bindings_types_StringType_New(struct MojomBuffer* in_buffer);

void mojo_bindings_types_StringType_Init(
  struct mojo_bindings_types_StringType* in_data);

void mojo_bindings_types_StringType_CloseAllHandles(
  struct mojo_bindings_types_StringType* in_data);

struct mojo_bindings_types_StringType* mojo_bindings_types_StringType_DeepCopy(
  struct MojomBuffer* in_buffer,
  struct mojo_bindings_types_StringType* in_data);

size_t mojo_bindings_types_StringType_ComputeSerializedSize(
  const struct mojo_bindings_types_StringType* in_data);

