// NOTE: This file was generated by the Mojo bindings generator.
#ifndef MOJO_PUBLIC_INTERFACES_BINDINGS_TESTS_MATH_CALCULATOR_MOJOM_INTERNAL_H_
#define MOJO_PUBLIC_INTERFACES_BINDINGS_TESTS_MATH_CALCULATOR_MOJOM_INTERNAL_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"
#include "mojo/public/cpp/bindings/lib/union_accessor.h"
#include "mojo/public/cpp/bindings/struct_ptr.h"
#include "mojo/public/cpp/system/buffer.h"
#include "mojo/public/cpp/system/data_pipe.h"
#include "mojo/public/cpp/system/handle.h"
#include "mojo/public/cpp/system/message_pipe.h"

namespace mojo {
namespace internal {
class BoundsChecker;
}
}
namespace math {



namespace internal {




#pragma pack(push, 1)



class Calculator_Clear_Params_Data {
 public:
  static Calculator_Clear_Params_Data* New(mojo::internal::Buffer* buf);

  static mojo::internal::ValidationError Validate(
      const void* data,
      mojo::internal::BoundsChecker* bounds_checker,
      std::string* err);

  void EncodePointersAndHandles(std::vector<mojo::Handle>* handles);
  void DecodePointersAndHandles(std::vector<mojo::Handle>* handles);

  mojo::internal::StructHeader header_;

 private:
  Calculator_Clear_Params_Data();
  ~Calculator_Clear_Params_Data() = delete;
};
static_assert(sizeof(Calculator_Clear_Params_Data) == 8,
              "Bad sizeof(Calculator_Clear_Params_Data)");

class Calculator_Clear_ResponseParams_Data {
 public:
  static Calculator_Clear_ResponseParams_Data* New(mojo::internal::Buffer* buf);

  static mojo::internal::ValidationError Validate(
      const void* data,
      mojo::internal::BoundsChecker* bounds_checker,
      std::string* err);

  void EncodePointersAndHandles(std::vector<mojo::Handle>* handles);
  void DecodePointersAndHandles(std::vector<mojo::Handle>* handles);

  mojo::internal::StructHeader header_;
  double value;

 private:
  Calculator_Clear_ResponseParams_Data();
  ~Calculator_Clear_ResponseParams_Data() = delete;
};
static_assert(sizeof(Calculator_Clear_ResponseParams_Data) == 16,
              "Bad sizeof(Calculator_Clear_ResponseParams_Data)");


class Calculator_Add_Params_Data {
 public:
  static Calculator_Add_Params_Data* New(mojo::internal::Buffer* buf);

  static mojo::internal::ValidationError Validate(
      const void* data,
      mojo::internal::BoundsChecker* bounds_checker,
      std::string* err);

  void EncodePointersAndHandles(std::vector<mojo::Handle>* handles);
  void DecodePointersAndHandles(std::vector<mojo::Handle>* handles);

  mojo::internal::StructHeader header_;
  double value;

 private:
  Calculator_Add_Params_Data();
  ~Calculator_Add_Params_Data() = delete;
};
static_assert(sizeof(Calculator_Add_Params_Data) == 16,
              "Bad sizeof(Calculator_Add_Params_Data)");

class Calculator_Add_ResponseParams_Data {
 public:
  static Calculator_Add_ResponseParams_Data* New(mojo::internal::Buffer* buf);

  static mojo::internal::ValidationError Validate(
      const void* data,
      mojo::internal::BoundsChecker* bounds_checker,
      std::string* err);

  void EncodePointersAndHandles(std::vector<mojo::Handle>* handles);
  void DecodePointersAndHandles(std::vector<mojo::Handle>* handles);

  mojo::internal::StructHeader header_;
  double value;

 private:
  Calculator_Add_ResponseParams_Data();
  ~Calculator_Add_ResponseParams_Data() = delete;
};
static_assert(sizeof(Calculator_Add_ResponseParams_Data) == 16,
              "Bad sizeof(Calculator_Add_ResponseParams_Data)");


class Calculator_Multiply_Params_Data {
 public:
  static Calculator_Multiply_Params_Data* New(mojo::internal::Buffer* buf);

  static mojo::internal::ValidationError Validate(
      const void* data,
      mojo::internal::BoundsChecker* bounds_checker,
      std::string* err);

  void EncodePointersAndHandles(std::vector<mojo::Handle>* handles);
  void DecodePointersAndHandles(std::vector<mojo::Handle>* handles);

  mojo::internal::StructHeader header_;
  double value;

 private:
  Calculator_Multiply_Params_Data();
  ~Calculator_Multiply_Params_Data() = delete;
};
static_assert(sizeof(Calculator_Multiply_Params_Data) == 16,
              "Bad sizeof(Calculator_Multiply_Params_Data)");

class Calculator_Multiply_ResponseParams_Data {
 public:
  static Calculator_Multiply_ResponseParams_Data* New(mojo::internal::Buffer* buf);

  static mojo::internal::ValidationError Validate(
      const void* data,
      mojo::internal::BoundsChecker* bounds_checker,
      std::string* err);

  void EncodePointersAndHandles(std::vector<mojo::Handle>* handles);
  void DecodePointersAndHandles(std::vector<mojo::Handle>* handles);

  mojo::internal::StructHeader header_;
  double value;

 private:
  Calculator_Multiply_ResponseParams_Data();
  ~Calculator_Multiply_ResponseParams_Data() = delete;
};
static_assert(sizeof(Calculator_Multiply_ResponseParams_Data) == 16,
              "Bad sizeof(Calculator_Multiply_ResponseParams_Data)");


#pragma pack(pop)

}  // namespace internal
}  // namespace math

#endif  // MOJO_PUBLIC_INTERFACES_BINDINGS_TESTS_MATH_CALCULATOR_MOJOM_INTERNAL_H_
