// This file was auto-generated by the C bindings generator.

#ifndef MOJO_PUBLIC_INTERFACES_BINDINGS_TESTS_REGRESSION_TESTS_MOJOM_C_H_
#define MOJO_PUBLIC_INTERFACES_BINDINGS_TESTS_REGRESSION_TESTS_MOJOM_C_H_

#include <assert.h>
#include <math.h>
#include <stdbool.h>
#include <stdint.h>

#include "mojo/public/c/bindings/array.h"
#include "mojo/public/c/bindings/buffer.h"
#include "mojo/public/c/bindings/interface.h"
#include "mojo/public/c/bindings/lib/type_table.h"
#include "mojo/public/c/bindings/map.h"
#include "mojo/public/c/bindings/string.h"
#include "mojo/public/c/bindings/validation.h"
#include "mojo/public/c/system/handle.h"

// Imports.


// Forward declarations for structs.
struct regression_tests_Edge;
union regression_tests_EdgePtr {
  struct regression_tests_Edge* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union regression_tests_EdgePtr) == 8,
              "union regression_tests_EdgePtr must be 8 bytes");

struct regression_tests_Vertex;
union regression_tests_VertexPtr {
  struct regression_tests_Vertex* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union regression_tests_VertexPtr) == 8,
              "union regression_tests_VertexPtr must be 8 bytes");

struct regression_tests_EmptyStruct;
union regression_tests_EmptyStructPtr {
  struct regression_tests_EmptyStruct* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union regression_tests_EmptyStructPtr) == 8,
              "union regression_tests_EmptyStructPtr must be 8 bytes");

struct regression_tests_A;
union regression_tests_APtr {
  struct regression_tests_A* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union regression_tests_APtr) == 8,
              "union regression_tests_APtr must be 8 bytes");

struct regression_tests_B;
union regression_tests_BPtr {
  struct regression_tests_B* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union regression_tests_BPtr) == 8,
              "union regression_tests_BPtr must be 8 bytes");

struct regression_tests_StructWithHandleCalledHandles;
union regression_tests_StructWithHandleCalledHandlesPtr {
  struct regression_tests_StructWithHandleCalledHandles* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union regression_tests_StructWithHandleCalledHandlesPtr) == 8,
              "union regression_tests_StructWithHandleCalledHandlesPtr must be 8 bytes");

struct regression_tests_StructWithArrayOfHandlesCalledHandles;
union regression_tests_StructWithArrayOfHandlesCalledHandlesPtr {
  struct regression_tests_StructWithArrayOfHandlesCalledHandles* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union regression_tests_StructWithArrayOfHandlesCalledHandlesPtr) == 8,
              "union regression_tests_StructWithArrayOfHandlesCalledHandlesPtr must be 8 bytes");

struct regression_tests_StructWithInterfaceCalledHandles;
union regression_tests_StructWithInterfaceCalledHandlesPtr {
  struct regression_tests_StructWithInterfaceCalledHandles* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union regression_tests_StructWithInterfaceCalledHandlesPtr) == 8,
              "union regression_tests_StructWithInterfaceCalledHandlesPtr must be 8 bytes");

struct regression_tests_ContainsArrayOfEnum;
union regression_tests_ContainsArrayOfEnumPtr {
  struct regression_tests_ContainsArrayOfEnum* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union regression_tests_ContainsArrayOfEnumPtr) == 8,
              "union regression_tests_ContainsArrayOfEnumPtr must be 8 bytes");

// Forward declarations for unions.
// Top level constants.


// Top level enums.
typedef uint32_t regression_tests_EnumWithReference;
enum regression_tests_EnumWithReference_Enum {
  regression_tests_EnumWithReference_k_STEREO_AND_KEYBOARD_MIC = 30,
  regression_tests_EnumWithReference_k_MAX = 30,
  
  regression_tests_EnumWithReference__UNKNOWN__ = 0xFFFFFFFF,
};

typedef uint32_t regression_tests_EnumWithLowercase;
enum regression_tests_EnumWithLowercase_Enum {
  regression_tests_EnumWithLowercase_PlanarF16 = 0,
  regression_tests_EnumWithLowercase_PlanarF32 = 1,
  
  regression_tests_EnumWithLowercase__UNKNOWN__ = 0xFFFFFFFF,
};

typedef uint32_t regression_tests_EnumWithNumbers;
enum regression_tests_EnumWithNumbers_Enum {
  regression_tests_EnumWithNumbers_k_2_1 = 4,
  
  regression_tests_EnumWithNumbers__UNKNOWN__ = 0xFFFFFFFF,
};

