// This file was auto-generated by the C bindings generator.

#ifndef MOJO_PUBLIC_INTERFACES_BINDINGS_TESTS_TEST_STRUCTS_MOJOM_C_H_
#define MOJO_PUBLIC_INTERFACES_BINDINGS_TESTS_TEST_STRUCTS_MOJOM_C_H_

#include <assert.h>
#include <math.h>
#include <stdbool.h>
#include <stdint.h>

#include "mojo/public/c/bindings/array.h"
#include "mojo/public/c/bindings/buffer.h"
#include "mojo/public/c/bindings/interface.h"
#include "mojo/public/c/bindings/lib/type_table.h"
#include "mojo/public/c/bindings/map.h"
#include "mojo/public/c/bindings/string.h"
#include "mojo/public/c/bindings/validation.h"
#include "mojo/public/c/system/handle.h"

// Imports.
#include "mojo/public/interfaces/bindings/tests/rect.mojom-c.h"


// Forward declarations for structs.
struct mojo_test_StructOfStructs;
union mojo_test_StructOfStructsPtr {
  struct mojo_test_StructOfStructs* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_StructOfStructsPtr) == 8,
              "union mojo_test_StructOfStructsPtr must be 8 bytes");

struct mojo_test_NamedRegion;
union mojo_test_NamedRegionPtr {
  struct mojo_test_NamedRegion* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_NamedRegionPtr) == 8,
              "union mojo_test_NamedRegionPtr must be 8 bytes");

struct mojo_test_RectPair;
union mojo_test_RectPairPtr {
  struct mojo_test_RectPair* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_RectPairPtr) == 8,
              "union mojo_test_RectPairPtr must be 8 bytes");

struct mojo_test_EmptyStruct;
union mojo_test_EmptyStructPtr {
  struct mojo_test_EmptyStruct* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_EmptyStructPtr) == 8,
              "union mojo_test_EmptyStructPtr must be 8 bytes");

struct mojo_test_HandleStruct;
union mojo_test_HandleStructPtr {
  struct mojo_test_HandleStruct* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_HandleStructPtr) == 8,
              "union mojo_test_HandleStructPtr must be 8 bytes");

struct mojo_test_NullableHandleStruct;
union mojo_test_NullableHandleStructPtr {
  struct mojo_test_NullableHandleStruct* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_NullableHandleStructPtr) == 8,
              "union mojo_test_NullableHandleStructPtr must be 8 bytes");

struct mojo_test_NoDefaultFieldValues;
union mojo_test_NoDefaultFieldValuesPtr {
  struct mojo_test_NoDefaultFieldValues* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_NoDefaultFieldValuesPtr) == 8,
              "union mojo_test_NoDefaultFieldValuesPtr must be 8 bytes");

struct mojo_test_DefaultFieldValues;
union mojo_test_DefaultFieldValuesPtr {
  struct mojo_test_DefaultFieldValues* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_DefaultFieldValuesPtr) == 8,
              "union mojo_test_DefaultFieldValuesPtr must be 8 bytes");

struct mojo_test_ScopedConstants;
union mojo_test_ScopedConstantsPtr {
  struct mojo_test_ScopedConstants* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_ScopedConstantsPtr) == 8,
              "union mojo_test_ScopedConstantsPtr must be 8 bytes");

struct mojo_test_MapKeyTypes;
union mojo_test_MapKeyTypesPtr {
  struct mojo_test_MapKeyTypes* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_MapKeyTypesPtr) == 8,
              "union mojo_test_MapKeyTypesPtr must be 8 bytes");

struct mojo_test_MapValueTypes;
union mojo_test_MapValueTypesPtr {
  struct mojo_test_MapValueTypes* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_MapValueTypesPtr) == 8,
              "union mojo_test_MapValueTypesPtr must be 8 bytes");

struct mojo_test_ArrayValueTypes;
union mojo_test_ArrayValueTypesPtr {
  struct mojo_test_ArrayValueTypes* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_ArrayValueTypesPtr) == 8,
              "union mojo_test_ArrayValueTypesPtr must be 8 bytes");

struct mojo_test_FloatNumberValues;
union mojo_test_FloatNumberValuesPtr {
  struct mojo_test_FloatNumberValues* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_FloatNumberValuesPtr) == 8,
              "union mojo_test_FloatNumberValuesPtr must be 8 bytes");

struct mojo_test_IntegerNumberValues;
union mojo_test_IntegerNumberValuesPtr {
  struct mojo_test_IntegerNumberValues* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_IntegerNumberValuesPtr) == 8,
              "union mojo_test_IntegerNumberValuesPtr must be 8 bytes");

struct mojo_test_UnsignedNumberValues;
union mojo_test_UnsignedNumberValuesPtr {
  struct mojo_test_UnsignedNumberValues* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_UnsignedNumberValuesPtr) == 8,
              "union mojo_test_UnsignedNumberValuesPtr must be 8 bytes");

struct mojo_test_BitArrayValues;
union mojo_test_BitArrayValuesPtr {
  struct mojo_test_BitArrayValues* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_BitArrayValuesPtr) == 8,
              "union mojo_test_BitArrayValuesPtr must be 8 bytes");

struct mojo_test_MultiVersionStruct;
union mojo_test_MultiVersionStructPtr {
  struct mojo_test_MultiVersionStruct* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_MultiVersionStructPtr) == 8,
              "union mojo_test_MultiVersionStructPtr must be 8 bytes");

struct mojo_test_MultiVersionStructV0;
union mojo_test_MultiVersionStructV0Ptr {
  struct mojo_test_MultiVersionStructV0* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_MultiVersionStructV0Ptr) == 8,
              "union mojo_test_MultiVersionStructV0Ptr must be 8 bytes");

struct mojo_test_MultiVersionStructV1;
union mojo_test_MultiVersionStructV1Ptr {
  struct mojo_test_MultiVersionStructV1* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_MultiVersionStructV1Ptr) == 8,
              "union mojo_test_MultiVersionStructV1Ptr must be 8 bytes");

struct mojo_test_MultiVersionStructV3;
union mojo_test_MultiVersionStructV3Ptr {
  struct mojo_test_MultiVersionStructV3* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_MultiVersionStructV3Ptr) == 8,
              "union mojo_test_MultiVersionStructV3Ptr must be 8 bytes");

struct mojo_test_MultiVersionStructV5;
union mojo_test_MultiVersionStructV5Ptr {
  struct mojo_test_MultiVersionStructV5* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_MultiVersionStructV5Ptr) == 8,
              "union mojo_test_MultiVersionStructV5Ptr must be 8 bytes");

struct mojo_test_MultiVersionStructV7;
union mojo_test_MultiVersionStructV7Ptr {
  struct mojo_test_MultiVersionStructV7* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_MultiVersionStructV7Ptr) == 8,
              "union mojo_test_MultiVersionStructV7Ptr must be 8 bytes");

struct mojo_test_ContainsInterface;
union mojo_test_ContainsInterfacePtr {
  struct mojo_test_ContainsInterface* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_ContainsInterfacePtr) == 8,
              "union mojo_test_ContainsInterfacePtr must be 8 bytes");

struct mojo_test_ContainsOther;
union mojo_test_ContainsOtherPtr {
  struct mojo_test_ContainsOther* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_ContainsOtherPtr) == 8,
              "union mojo_test_ContainsOtherPtr must be 8 bytes");

struct mojo_test_ContainsInterfaceRequest;
union mojo_test_ContainsInterfaceRequestPtr {
  struct mojo_test_ContainsInterfaceRequest* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_ContainsInterfaceRequestPtr) == 8,
              "union mojo_test_ContainsInterfaceRequestPtr must be 8 bytes");

struct mojo_test_DartKeywordStruct;
union mojo_test_DartKeywordStructPtr {
  struct mojo_test_DartKeywordStruct* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_DartKeywordStructPtr) == 8,
              "union mojo_test_DartKeywordStructPtr must be 8 bytes");

// Forward declarations for unions.
struct mojo_test_UnionOfStructs;
union mojo_test_UnionOfStructsPtr {
  struct mojo_test_UnionOfStructs* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_UnionOfStructsPtr) == 8,
             "union mojo_test_UnionOfStructs must be 8 bytes");

// Top level constants.


// Top level enums.


// Union definitions.
// -- mojo_test_UnionOfStructs --
// Enum describing the union tags.
typedef uint32_t mojo_test_UnionOfStructs_Tag;
enum mojo_test_UnionOfStructs_Tag_Enum {
  mojo_test_UnionOfStructs_Tag_nr = 0,
  mojo_test_UnionOfStructs_Tag_a_nr = 1,
  mojo_test_UnionOfStructs_Tag_a_rp = 2,
  mojo_test_UnionOfStructs_Tag_m_ndfv = 3,
  mojo_test_UnionOfStructs_Tag_m_hs = 4,
  
  mojo_test_UnionOfStructs_Tag__UNKNOWN__ = 0xFFFFFFFF,
};


struct mojo_test_UnionOfStructs {
  uint32_t size;
  mojo_test_UnionOfStructs_Tag tag;
  
  union {
    union mojo_test_NamedRegionPtr f_nr;
    union MojomArrayPtr f_a_nr;
    union MojomArrayPtr f_a_rp;
    union MojomMapPtr f_m_ndfv;
    union MojomMapPtr f_m_hs;
    
    uint64_t unknown;
  } data;
};

MOJO_STATIC_ASSERT(sizeof(struct mojo_test_UnionOfStructs) == 16,
             "struct mojo_test_UnionOfStructs must be 16 bytes");



// Struct definitions.
// -- mojo_test_StructOfStructs --
// Enums
// Constants
// Struct definition
struct mojo_test_StructOfStructs {
  struct MojomStructHeader header_;
  union mojo_test_NamedRegionPtr nr;  // offset,bit = 0,0
  union MojomArrayPtr a_nr;  // offset,bit = 8,0
  union MojomArrayPtr a_rp;  // offset,bit = 16,0
  union MojomMapPtr m_ndfv;  // offset,bit = 24,0
  union MojomMapPtr m_hs;  // offset,bit = 32,0
  
};

struct mojo_test_StructOfStructs* mojo_test_StructOfStructs_New(struct MojomBuffer* in_buffer);

void mojo_test_StructOfStructs_Init(
  struct mojo_test_StructOfStructs* in_data);

void mojo_test_StructOfStructs_CloseAllHandles(
  struct mojo_test_StructOfStructs* in_data);

struct mojo_test_StructOfStructs* mojo_test_StructOfStructs_DeepCopy(
  struct MojomBuffer* in_buffer,
  struct mojo_test_StructOfStructs* in_data);

