// This file was auto-generated by the C bindings generator.

#ifndef MOJO_PUBLIC_INTERFACES_BINDINGS_TESTS_VALIDATION_TEST_INTERFACES_MOJOM_C_H_
#define MOJO_PUBLIC_INTERFACES_BINDINGS_TESTS_VALIDATION_TEST_INTERFACES_MOJOM_C_H_

#include <assert.h>
#include <math.h>
#include <stdbool.h>
#include <stdint.h>

#include "mojo/public/c/bindings/array.h"
#include "mojo/public/c/bindings/buffer.h"
#include "mojo/public/c/bindings/interface.h"
#include "mojo/public/c/bindings/lib/type_table.h"
#include "mojo/public/c/bindings/map.h"
#include "mojo/public/c/bindings/string.h"
#include "mojo/public/c/bindings/validation.h"
#include "mojo/public/c/system/handle.h"

// Imports.


// Forward declarations for structs.
struct mojo_test_StructA;
union mojo_test_StructAPtr {
  struct mojo_test_StructA* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_StructAPtr) == 8,
              "union mojo_test_StructAPtr must be 8 bytes");

struct mojo_test_StructB;
union mojo_test_StructBPtr {
  struct mojo_test_StructB* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_StructBPtr) == 8,
              "union mojo_test_StructBPtr must be 8 bytes");

struct mojo_test_StructC;
union mojo_test_StructCPtr {
  struct mojo_test_StructC* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_StructCPtr) == 8,
              "union mojo_test_StructCPtr must be 8 bytes");

struct mojo_test_StructD;
union mojo_test_StructDPtr {
  struct mojo_test_StructD* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_StructDPtr) == 8,
              "union mojo_test_StructDPtr must be 8 bytes");

struct mojo_test_StructE;
union mojo_test_StructEPtr {
  struct mojo_test_StructE* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_StructEPtr) == 8,
              "union mojo_test_StructEPtr must be 8 bytes");

struct mojo_test_StructF;
union mojo_test_StructFPtr {
  struct mojo_test_StructF* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_StructFPtr) == 8,
              "union mojo_test_StructFPtr must be 8 bytes");

struct mojo_test_StructG;
union mojo_test_StructGPtr {
  struct mojo_test_StructG* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_StructGPtr) == 8,
              "union mojo_test_StructGPtr must be 8 bytes");

struct mojo_test_StructH;
union mojo_test_StructHPtr {
  struct mojo_test_StructH* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_StructHPtr) == 8,
              "union mojo_test_StructHPtr must be 8 bytes");

struct mojo_test_BasicStruct;
union mojo_test_BasicStructPtr {
  struct mojo_test_BasicStruct* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_BasicStructPtr) == 8,
              "union mojo_test_BasicStructPtr must be 8 bytes");

struct mojo_test_StructWithEnum;
union mojo_test_StructWithEnumPtr {
  struct mojo_test_StructWithEnum* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_StructWithEnumPtr) == 8,
              "union mojo_test_StructWithEnumPtr must be 8 bytes");

// Forward declarations for unions.
struct mojo_test_UnionA;
union mojo_test_UnionAPtr {
  struct mojo_test_UnionA* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_UnionAPtr) == 8,
             "union mojo_test_UnionA must be 8 bytes");

struct mojo_test_UnionB;
union mojo_test_UnionBPtr {
  struct mojo_test_UnionB* ptr;
  uint64_t offset;
};
MOJO_STATIC_ASSERT(sizeof(union mojo_test_UnionBPtr) == 8,
             "union mojo_test_UnionB must be 8 bytes");

// Top level constants.


// Top level enums.
typedef uint32_t mojo_test_BasicEnum;
enum mojo_test_BasicEnum_Enum {
  mojo_test_BasicEnum_A = 0,
  mojo_test_BasicEnum_B = 1,
  mojo_test_BasicEnum_C = 0,
  mojo_test_BasicEnum_D = -3,
  mojo_test_BasicEnum_E = 10,
  
  mojo_test_BasicEnum__UNKNOWN__ = 0xFFFFFFFF,
};



// Union definitions.
// -- mojo_test_UnionA --
// Enum describing the union tags.
typedef uint32_t mojo_test_UnionA_Tag;
enum mojo_test_UnionA_Tag_Enum {
  mojo_test_UnionA_Tag_a = 0,
  mojo_test_UnionA_Tag_b = 1,
  mojo_test_UnionA_Tag_c = 2,
  mojo_test_UnionA_Tag_d = 3,
  mojo_test_UnionA_Tag_e = 4,
  mojo_test_UnionA_Tag_f = 5,
  mojo_test_UnionA_Tag_g = 6,
  mojo_test_UnionA_Tag_h = 7,
  mojo_test_UnionA_Tag_i = 8,
  mojo_test_UnionA_Tag_j = 9,
  
  mojo_test_UnionA_Tag__UNKNOWN__ = 0xFFFFFFFF,
};


struct mojo_test_UnionA {
  uint32_t size;
  mojo_test_UnionA_Tag tag;
  
  union {
    uint16_t f_a;
    uint32_t f_b;
    union mojo_test_StructAPtr f_c;
    union MojomArrayPtr f_d;
    union MojomMapPtr f_e;
    union mojo_test_UnionBPtr f_f;
    union mojo_test_StructAPtr f_g;
    union MojomArrayPtr f_h;
    union MojomMapPtr f_i;
    union mojo_test_UnionBPtr f_j;
    
    uint64_t unknown;
  } data;
};

MOJO_STATIC_ASSERT(sizeof(struct mojo_test_UnionA) == 16,
             "struct mojo_test_UnionA must be 16 bytes");

// -- mojo_test_UnionB --
// Enum describing the union tags.
typedef uint32_t mojo_test_UnionB_Tag;
enum mojo_test_UnionB_Tag_Enum {
  mojo_test_UnionB_Tag_a = 0,
  mojo_test_UnionB_Tag_b = 1,
  mojo_test_UnionB_Tag_c = 2,
  mojo_test_UnionB_Tag_d = 3,
  
  mojo_test_UnionB_Tag__UNKNOWN__ = 0xFFFFFFFF,
};


struct mojo_test_UnionB {
  uint32_t size;
  mojo_test_UnionB_Tag tag;
  
  union {
    uint16_t f_a;
    uint32_t f_b;
    uint64_t f_c;
    uint32_t f_d;
    
    uint64_t unknown;
  } data;
};

MOJO_STATIC_ASSERT(sizeof(struct mojo_test_UnionB) == 16,
             "struct mojo_test_UnionB must be 16 bytes");



// Struct definitions.
// -- mojo_test_StructA --
// Enums
// Constants
// Struct definition
struct mojo_test_StructA {
  struct MojomStructHeader header_;
  uint64_t i;  // offset,bit = 0,0
  
};

struct mojo_test_StructA* mojo_test_StructA_New(struct MojomBuffer* in_buffer);

void mojo_test_StructA_Init(
  struct mojo_test_StructA* in_data);

void mojo_test_StructA_CloseAllHandles(
  struct mojo_test_StructA* in_data);

struct mojo_test_StructA* mojo_test_StructA_DeepCopy(
  struct MojomBuffer* in_buffer,
  struct mojo_test_StructA* in_data);

size_t mojo_test_StructA_ComputeSerializedSize(
  const struct mojo_test_StructA* in_data);

MojomValidationResult mojo_test_StructA_EncodePointersAndHandles(
  void* inout_buf, uint32_t in_buf_size, MojoHandle* inout_handles,
  uint32_t in_num_handles, uint32_t* out_num_handles);

